/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：悟空找房h5
2. 文件名：libs -> location.js
3. 作者：zhaohuagang@lifang.com
4. 备注：H5地理定位封装
            使用cookie来进行定位数据的缓存，主要是为了和老站对接，cookie里面暂时只存了经纬度，如果需要更多，在代码里面添加，可以有：
            coords.latitude 	十进制数的纬度
            coords.longitude 	十进制数的经度
            coords.accuracy 	位置精度
            coords.altitude 	海拔，海平面以上以米计
            coords.altitudeAccuracy 	位置的海拔精度
            coords.heading 	方向，从正北开始以度计
            coords.speed 	速度，以米/每秒计
            timestamp 	响应的日期/时间
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
class Location {
    constructor({ success , fail }) {
        this.coordinates = null ;  //用户位置信息
        this.cookieKeyPrefix = "location_" ;  //cookie里面位置信息缓存的前缀
        this.success = success || $.noop ;  //拿到位置信息后的回调函数
        this.fail = fail || $.noop ;  //拿不到地址位置的回调函数
        /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        判断浏览器是否支持cookie，1. 如果支持
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        if( window.navigator.cookieEnabled ) {
            let latitude = $.cookie(this.cookieKeyPrefix + "latitude") || "" ;
            let longitude = $.cookie(this.cookieKeyPrefix + "longitude") || "" ; 
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------            
            cookie里面是否有存储的地理位置的值，如果有，就组织成coordinates对象，并调用成功处理的回调方法
            -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/       
            if(latitude && longitude) {
                this.coordinates = {
                    "latitude" : latitude ,
                    "longitude" : longitude
                } ;
                this.success(this.coordinates) ;
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------            
            否则调用H5的定位并将定位信息保存
            -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/  
            else {
                //$.tips("浏览器支持cookie但是还没有缓存位置信息！") ;
                console.log("浏览器支持cookie但是还没有缓存位置信息！") ;
                this.orientate() ;
            }
        }
        /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        否则就要发起定位，并且没有办法将位置信息存储到sessionStorage里面
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        else {
            //$.tips("浏览器不支持cookie！") ;
            console.log("浏览器不支持cookie！") ;
            this.orientate() ;
        } 
    }
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    发起定位，并根据浏览器是否支持cookie决定是否要将位置信息存储到缓存
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    orientate() {
        /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        判断浏览器是否支持H5的geolocation
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        if( ! navigator.geolocation ) {
            $.tips( "您的浏览器不支持定位地理位置" , 2 ) ;
            this.fail() ;
            return ;
        }
        /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        开始发起定位
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        navigator.geolocation.getCurrentPosition( (position) => {
            let latitude = position.coords.latitude ;
            let longitude = position.coords.longitude ;
            this.coordinates = {
                "latitude" : latitude ,
                "longitude" : longitude
            } ;
            if( window.navigator.cookieEnabled ) {                
                $.cookie(this.cookieKeyPrefix + "latitude" , latitude) ;
                $.cookie(this.cookieKeyPrefix + "longitude" , longitude) ;
            }
            this.success(this.coordinates) ;
        } , ( error ) => {
            switch(error.code) {
                case error.PERMISSION_DENIED :  //用户阻止了授权
                this.fail() ;
                break ;

                case error.POSITION_UNAVAILABLE :  //定位信息无效
                this.fail() ;
                break ;

                case error.TIMEOUT :  //定位超时
                this.fail() ;
                break ;

                case error.UNKNOWN_ERROR :  //其他不可预知的错误
                this.fail() ;
                break ;
            }
        } ) ;
    }
    

}